# YOLOv12 🚀, AGPL-3.0 许可证
# YOLOv12 目标检测模型，具有 P3-P5 输出。有关使用示例，请参阅 https://docs.ultralytics.com/tasks/detect
# YOLOv12-turbo 配置文件

# 参数
nc: 80 # 类别数量
scales: # 模型复合缩放常数，即 'model=yolov12n.yaml' 会调用 yolov12.yaml 进行缩放 'n'
  # [深度, 宽度, 最大通道数]
  n: [0.50, 0.25, 1024] # 概要：497 层，2,553,904 参数，2,553,888 梯度，6.2 GFLOPs
  s: [0.50, 0.50, 1024] # 概要：497 层，9,127,424 参数，9,127,408 梯度，19.7 GFLOPs
  m: [0.50, 1.00, 512] # 概要：533 层，19,670,784 参数，19,670,768 梯度，60.4 GFLOPs
  l: [1.00, 1.00, 512] # 概要：895 层，26,506,496 参数，26,506,480 梯度，83.3 GFLOPs
  x: [1.00, 1.50, 512] # 概要：895 层，59,414,176 参数，59,414,160 梯度，185.9 GFLOPs


# YOLOv12-turbo 主干网络
backbone:
  # [来自, 重复次数, 模块, 参数]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLOv12-turbo 输出头部
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 上采样
  - [[-1, 6], 1, Concat, [1]] # 拼接主干网络 P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 上采样
  - [[-1, 4], 1, Concat, [1]] # 拼接主干网络 P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, Conv, [256, 3, 2]] # 卷积层
  - [[-1, 11], 1, Concat, [1]] # 拼接头部 P4
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, Conv, [512, 3, 2]] # 卷积层
  - [[-1, 8], 1, Concat, [1]] # 拼接头部 P5
  - [-1, 2, C3k2, [1024, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # 检测 (P3, P4, P5)
