# Ultralytics YOLO11-obb 旋转目标检测（Oriented Bounding Boxes，OBB）模型，具有 P3/8 - P5/32 输出
# 模型文档: https://docs.ultralytics.com/models/yolo11
# 任务文档: https://docs.ultralytics.com/tasks/obb

# 参数
nc: 80 # 类别数量
scales: # 模型的复合缩放常数，例如 'model=yolo11n-obb.yaml' 将调用 yolo11-obb.yaml 并使用缩放参数 'n'
  # [深度, 宽度, 最大通道数]
  n: [0.50, 0.25, 1024] # 结构摘要: 344 层, 2695747 参数, 2695731 梯度, 6.9 GFLOPs
  s: [0.50, 0.50, 1024] # 结构摘要: 344 层, 9744931 参数, 9744915 梯度, 22.7 GFLOPs
  m: [0.50, 1.00, 512]  # 结构摘要: 434 层, 20963523 参数, 20963507 梯度, 72.2 GFLOPs
  l: [1.00, 1.00, 512]  # 结构摘要: 656 层, 26220995 参数, 26220979 梯度, 91.3 GFLOPs
  x: [1.00, 1.50, 512]  # 结构摘要: 656 层, 58875331 参数, 58875315 梯度, 204.3 GFLOPs

# YOLO11n 骨干网络（backbone）
backbone:
  # [来源, 重复次数, 模块, 参数]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2  卷积层，输出通道数 64，3x3 过滤器，步长 2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4  卷积层，输出通道数 128，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  C3k2 模块，输出 256 通道
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8  卷积层，输出通道数 256，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  C3k2 模块，输出 512 通道
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16 卷积层，输出通道数 512，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [512, True]]  # 6  C3k2 模块，输出 512 通道
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 卷积层，输出通道数 1024，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [1024, True]] # 8  C3k2 模块，输出 1024 通道
  - [-1, 1, SPPF, [1024, 5]] # 9 SPPF（空间金字塔池化）模块，输出 1024 通道，池化核大小 5
  - [-1, 2, C2PSA, [1024]] # 10 C2PSA（注意力机制）模块，输出 1024 通道

# YOLO11n 头部（head）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 上采样，放大 2 倍
  - [[-1, 6], 1, Concat, [1]] # 拼接骨干网络的 P4 特征图
  - [-1, 2, C3k2, [512, False]] # 13 C3k2 模块，输出 512 通道

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 上采样，放大 2 倍
  - [[-1, 4], 1, Concat, [1]] # 拼接骨干网络的 P3 特征图
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-小目标) C3k2 模块，输出 256 通道

  - [-1, 1, Conv, [256, 3, 2]] # 卷积层，步长 2，下采样
  - [[-1, 13], 1, Concat, [1]] # 拼接头部 P4 特征图
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-中等目标) C3k2 模块，输出 512 通道

  - [-1, 1, Conv, [512, 3, 2]] # 卷积层，步长 2，下采样
  - [[-1, 10], 1, Concat, [1]] # 拼接头部 P5 特征图
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-大目标) C3k2 模块，输出 1024 通道

  - [[16, 19, 22], 1, OBB, [nc, 1]] # 旋转目标检测（OBB），用于 P3、P4、P5
