# Ultralytics YOLO11-cls 图像分类模型
# 模型文档: https://docs.ultralytics.com/models/yolo11
# 任务文档: https://docs.ultralytics.com/tasks/classify

# 参数
nc: 80 # 类别数量
scales: # 模型的复合缩放常数，例如 'model=yolo11n-cls.yaml' 将调用 yolo11-cls.yaml 并使用缩放参数 'n'
  # [深度, 宽度, 最大通道数]
  n: [0.50, 0.25, 1024] # 结构摘要: 151 层, 1633584 参数, 1633584 梯度, 3.3 GFLOPs
  s: [0.50, 0.50, 1024] # 结构摘要: 151 层, 5545488 参数, 5545488 梯度, 12.2 GFLOPs
  m: [0.50, 1.00, 512]  # 结构摘要: 187 层, 10455696 参数, 10455696 梯度, 39.7 GFLOPs
  l: [1.00, 1.00, 512]  # 结构摘要: 309 层, 12937104 参数, 12937104 梯度, 49.9 GFLOPs
  x: [1.00, 1.50, 512]  # 结构摘要: 309 层, 28458544 参数, 28458544 梯度, 111.1 GFLOPs

# YOLO11n 骨干网络（backbone）
backbone:
  # [来源, 重复次数, 模块, 参数]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2  卷积层，输出通道数 64，3x3 过滤器，步长 2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4  卷积层，输出通道数 128，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  C3k2 模块，输出 256 通道
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8  卷积层，输出通道数 256，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  C3k2 模块，输出 512 通道
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16 卷积层，输出通道数 512，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [512, True]]  # 6  C3k2 模块，输出 512 通道
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 卷积层，输出通道数 1024，3x3 过滤器，步长 2
  - [-1, 2, C3k2, [1024, True]] # 8  C3k2 模块，输出 1024 通道
  - [-1, 2, C2PSA, [1024]]      # 9  C2PSA 模块，输出 1024 通道

# YOLO11n 头部（head）
head:
  - [-1, 1, Classify, [nc]] # 分类层，输出类别数（nc）
